\documentclass[a4paper]{article}

\usepackage{amsmath,amsthm,amssymb}
\usepackage[T2A]{fontenc}
\usepackage[utf8]{inputenc}
\usepackage[english,russian]{babel}
\usepackage{graphicx}

\begin{document}
\title{Лабораторная работа №3.Использование автоматических генераторов анализаторов Bison и ANTLR}
\author{Иван Громаковский}
\date{23 апреля 2014}
\maketitle

\section{Задание}

Выберите подмножества языка C++, Java или Pascal и напишите обфускатор для программ данного подмножества. Обфускатор должен заменять имена переменных на случайные строки из символов I, 1, O и 0, которые являются корректными идентификаторами и в случае одинаково выглядящих символов I – 1 и O – 0, соответственно, выглядеть одинаково. Также обфускатор должен вставлять в различные места программы незначащие действия с переменными, которые затрудняют понимание программы, в том числе добавлять новые переменные.

\section{Ход работы}
\subsection{Выбор языка и подмножества}

В качестве языка был выбран C++. Подмножество было выбрано таким образом, чтобы можно было написать программу, которая делает что-нибудь разумное (например, выводит "Hello, world"), при этом сделав не очень трудную грамматику.
В программе могут быть комментарии, директивы препроцессора, объявления и определения функций, переменные. Внутри функции можно вызывать другие функции и объявлять переменные.

\subsection{Используемые инструменты}

Лексический анализатор генерируется с помощью flex, грамматика генерируется с помощью Bison, управляющий код написан на C++.

\section{Пример}

Исходный файл:

\begin{verbatim}
// Hello world
#include <cstdio>

int main()
{
    const char * hello;
    hello = "Hello, world!";
    printf(hello);
    return 0;
}
\end{verbatim}

После обфускации:

\begin{verbatim}

/*
	It is an obfuscated version of test2.cpp
*/

#include <cstdio>
int  main()
{
const char  *  O00;
bool IO01;
O00 =  "H"
 "e"
 "l"
 "l"
 "o"
 ","
 " "
 "w"
 "o"
 "r"
 "l"
 "d"
 "!"
;
printf(O00);
return (0 + 0);

}

\end{verbatim}

\end{document}
